#include <stdio.h>
int main()
{
   int i=1;
   for (i=1000;i>10;i--)  //杩戝崈鍚嶏紝鎵�浠ヤ粠1000閫嗗簭绌蜂妇
   {
       if (i%5==2 && i%7==3 && i%3==1)
       { 
          printf("%d\n",i);
          break;
       }
   }
   return 0;
}
//	int n=1000,flag=1;
// 	//n%5=2   n%7=3   n%3=1
//	while(flag){
//		
//		if(n%5==2){
//			if(n%7==3)
//				if(n%3==1)
//					flag=0;}else n--;
//	}
//	
//	printf("%d",n);
// 	return 0;
//从编写程序的严谨角度，第一循环条件不设置不妥，
//如果按你目前的代码，则若找不到满足条件的数据，
//则会出现死循环；另外循环内部，应该是满足条件后，先输出结果，
//然后再结束循环。如果按你目前的代码，则若找不到满足条件的数据，同样也会输出n的值。
